{
  "main": {
    "name": "Benjamin Tang",
    "description": "Computer Science, Business, Robotics @ Cornell.",
    "image": "pfp.jpg",
    "bio": "Quick learner seeking to gain experience in software development and robotics with proven skills in Java and collaboration. Eager to discover new insights by synthesizing technology, business, and art. Named as a Meinig Scholar, awarded to 1.3% of Cornell undergrads for leadership and academic excellence.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "bt283@cornell.edu",
    "phone": "408-834-6568",
    "github": "https://github.com/benjamin0t",
    "project": "https://github.com/benjamin0t/website",
    "address": {
      "street": "(Your Street)",
      "city": "Bay Area",
      "state": "(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.benjamint.xyz",
    "resumedownload": "https://drive.google.com/file/d/1cWJBDHjoZJ6Y6rob78qcmtfa-o7NnBUY/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/b3njamint/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/b3njamint",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "Cornell University",
        "degree": "B.S. Computer Science | Math, Business, Robotics",
        "graduated": "May 2025",
        "description": "3.9 GPA. Dean's List | Meinig National Scholar | Organizations: Corporate Officer @ Association of Computer Science Undergrads. Software Developer @ Design & Tech Initiative. Cornell Undergraduate Research Board. Chinese Student Association."
      },
      {
        "school": "Monta Vista High School",
        "degree": "HS Diploma",
        "graduated": "June 2021",
        "description": "4.3 GPA | Organizations: AP Physics C Teaching Assistant. Director of Marketing & PR @ MV Robotics Team."
      }
    ],
    "work": [
      {
        "company": "Verizon ✓",
        "title": "Software Engineering Intern",
        "years": "June 2022 - August 2022",
        "description": "Automated DNS reroutes in AWS, Route 53 for thousands of video calls, cutting time to resolution by 80% and minimizing self-induced outages, incorporated data validation, using JavaScript and Node.js. Streamlined server deployment: automated IPMI configurations, DHCP reservations, and machine inventory; saving 96 man-hours annually and eliminating human error, using Python, Bash, and Device42 API. Implemented a scalable SSD health-monitoring feature for 3000+ servers to eliminate storage-induced outages, predict time to failure by analyzing usage trends, using Intel MAS."
      },
      {
        "company": "Cornell University CIS",
        "title": "Data Structures + OO Programming Teaching Assistant",
        "years": "August 2022 – Present",
        "description": "Course staff for a record class of 670+ students; developing tools to optimize grading workflow. Facilitating discussion sections of 48 students, holding weekly office hours, and moderating discussion boards."
      },
      {
        "company": "Cornell Design & Tech Initiative",
        "title": "Software Developer",
        "years": "August 2021 – Present",
        "description": "Working on Zing, an app to optimize student grouping with nearly 1000 users from 300+ courses. Built search bar + loading screen for Zing using TypeScript, React, and MUI, enabled cross-listed classes in Firebase, used React hooks to standardize URLs, and redesigning emailing feature with Azure."
      },
      {
        "company": "Applied Computing Foundation",
        "title": "Program Management Intern",
        "years": "March 2022 - Present",
        "description": "Co-founded the Monthly App Challenge program, led weekly web dev workshops for 20-50 students worldwide to solve real-world problems with tech, bolstered attendance by 700% in half year. Revamped website UI/UX and surged page traffic by 4x, used HTML, CSS, and JavaScript. Devised 1 year curriculum for 30+ student startups, supporting innovation, rapid development, and efficient market entry. Coaching a student tech startup to solve mental health for space industries, using React and Machine Learning."
      },
      {
        "company": "Stanford Medicine",
        "title": "Bioinformatics Research Assistant",
        "years": "June 2021 - August 2021",
        "description": "Normalized, visualized, and performed differential analysis on human and equine genes using R, DESeq2, and EdgeR. Presented research on how gene expression can influence the risk of knee osteoarthritis."
      }
    ],
    "projects": [
      {
        "title": "Circus: Connecting Freelancing Services",
        "time": "2022",
        "link": "https://github.com/jjennifergu/freelance-marketplace-backend",
        "description": "Built a scalable iOS app to connect Cornell students with the freelancing community, using Python and Swift. Wrote 15+ REST API endpoints using Flask, implemented session-based authentication, architected database in SQLite and SQLAlchemy, and containerized/deployed using Docker and GCP. Awarded Best Frontend/UI by Cornell App Development out of 150+ students."
      },
      {
        "title": "Cars 4: Not a Pixar Movie",
        "time": "2021",
        "link": "https://github.com/DylanTom/info-final-project/blob/main/INFO%201998%20Final%20Project.ipynb",
        "description": "Predicted car manufacturer and price from 427,000 instances and 20+ features. Trained linear regression, KNN classification, and decision tree classifier models in Python. Performed extensive data analysis and visualization using Jupyter and Matplotlib."
      },
      {
        "title": "Vobyus: AI Car Dashboard",
        "time": "2020-2021",
        "link": "https://www.voby.us/",
        "description": "Co-founded student entrepreneurship team, won 1st place at the 2021 Model Entrepreneur Competition by Columbia Business School and recognized as a Conrad Innovator. Led development of smart car dashboard, detecting drowsiness with 85% accurcy to prevent vehicle accidents, used JavaScript, Python, TensorFlow."
      },
      {
        "title": "AI Art Critic",
        "time": "2020",
        "link": "https://aiartcritic.com",
        "description": "Trained classification models with 25,000 images to critique art, designed algorithms to analyze pixels in Python. Developed a website using Django and hosted on Google Cloud."
      }
    ],
    "skillmessage": "Here are some of my skills!",
    "skills": [ {
        "name": "Frontend (JavaScript, TypeScript, React, HTML/CSS)",
        "level": "80%"
      },
      {
        "name": "Backend + Databases (Firebase, Flask, SQL)",
        "level": ""
      },
      {
        "name": "Cloud Computing Services (AWS, GCP, Azure)",
        "level": "70%"
      },
      {
        "name": "Data Analysis/Machine Learning (Python, R)",
        "level": "70%"
      },
      {
        "name": "OO Programming/Data Structures (Java, Python, C++)",
        "level": "90%"
      },
      {
        "name": "Functional Programming (OCaml)",
        "level": "80%"
      },
      {
        "name": "Design (Adobe Creative Suite, Figma)",
        "level": "60%"
      }]
  },
  "portfolio": {
    "art": []
  }
}
